# YOLOv8m Custom - Deeper Backbone (V2)
# Adds extra Conv blocks after layer2 in the backbone to increase depth and feature extraction capability.
# Modification: Added 2 Conv layers after C2f module at index 2.

nc: 5
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # === Standard Backbone with Extra Conv Block after layer2 ===
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 3, C2f, [128, True]]              # 2
  
  # >>> ADDED: Extra Conv Block after layer2 <<<
  - [-1, 1, Conv, [128, 3, 1, 1]]          # 3-new: Conv with padding (keep resolution)
  - [-1, 1, Conv, [128, 3, 1, 1]]          # 4-new: Conv with padding (deepen features)
  # ================================================
  
  - [-1, 1, Conv, [256, 3, 2]]             # 5-P3/8 (was 3)
  - [-1, 6, C2f, [256, True]]              # 6 (was 4)
  - [-1, 1, Conv, [512, 3, 2]]             # 7-P4/16 (was 5)
  - [-1, 6, C2f, [512, True]]              # 8 (was 6)
  - [-1, 1, Conv, [1024, 3, 2]]            # 9-P5/32 (was 7)
  - [-1, 3, C2f, [1024, True]]             # 10 (was 8)
  - [-1, 1, SPPF, [1024, 5]]               # 11 (was 9)

neck:
  # === All indices shifted by +2 due to added layers ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12 (was 10)
  - [[-1, 8], 1, Concat, [1]]                    # 13 (was 11, from 6->8)
  - [-1, 3, C2f, [512]]                          # 14 (was 12)
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15 (was 13)
  - [[-1, 6], 1, Concat, [1]]                    # 16 (was 14, from 4->6)
  - [-1, 3, C2f, [256]]                          # 17 (was 15) P3 Output
  
  - [-1, 1, Conv, [256, 3, 2]]                   # 18 (was 16)
  - [[-1, 14], 1, Concat, [1]]                   # 19 (was 17, from 12->14)
  - [-1, 3, C2f, [512]]                          # 20 (was 18) P4 Output
  
  - [-1, 1, Conv, [512, 3, 2]]                   # 21 (was 19)
  - [[-1, 11], 1, Concat, [1]]                   # 22 (was 20, from 9->11)
  - [-1, 3, C2f, [1024]]                         # 23 (was 21) P5 Output

head:
  - [[17, 20, 23], 1, Detect, [nc]]              # Detect(P3, P4, P5) (was 15,18,21)
