# YOLOv8m Custom - Deeper Backbone (V2)
# Adds extra convolutional layers to the backbone for enhanced feature extraction.

nc: 5
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # P1/2
  - [-1, 1, Conv, [64, 3, 2]]              # 0
  # P2/4
  - [-1, 1, Conv, [128, 3, 2]]             # 1
  - [-1, 3, C2f, [128, True]]              # 2
  # P3/8
  - [-1, 1, Conv, [256, 3, 2]]             # 3
  - [-1, 6, C2f, [256, True]]              # 4
  # P4/16
  - [-1, 1, Conv, [512, 3, 2]]             # 5
  - [-1, 6, C2f, [512, True]]              # 6
  # P5/32
  - [-1, 1, Conv, [1024, 3, 2]]            # 7
  - [-1, 3, C2f, [1024, True]]             # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  
  # === Custom Added Layers (Deeper Backbone) ===
  - [-1, 1, Conv, [512, 1, 1]]             # 10 (Reduce channels)
  - [-1, 2, C2f, [512, True]]              # 11 (Extra feature processing)
  - [-1, 1, Conv, [1024, 3, 1]]            # 12 (Restore channels)

neck:
  # Upsample path 1 (P5 -> P4)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 6], 1, Concat, [1]]                    # 14 (Cat with P4 from backbone index 6)
  - [-1, 3, C2f, [512]]                          # 15
  
  # Upsample path 2 (P4 -> P3)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 4], 1, Concat, [1]]                    # 17 (Cat with P3 from backbone index 4)
  - [-1, 3, C2f, [256]]                          # 18 (P3 Output for Detect)
  
  # Downsample path 1 (P3 -> P4)
  - [-1, 1, Conv, [256, 3, 2]]                   # 19
  - [[-1, 15], 1, Concat, [1]]                   # 20 (Cat with previous P4 level)
  - [-1, 3, C2f, [512]]                          # 21 (P4 Output for Detect)
  
  # Downsample path 2 (P4 -> P5)
  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 12], 1, Concat, [1]]                   # 23 (Cat with final backbone layer)
  - [-1, 3, C2f, [1024]]                         # 24 (P5 Output for Detect)

head:
  - [[18, 21, 24], 1, Detect, [nc]]              # Detect(P3, P4, P5)
