# YOLOv8m Custom - Shallow Backbone (减少卷积层)
# 移除layer4和layer5中的部分C2f模块

nc: 5
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 6, C2f, [256, True]]              # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  
  # === 修改: 减少C2f重复次数从6到3 ===
  - [-1, 3, C2f, [512, True]]              # 6 (原来是6次，现在3次)
  
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  
  # === 修改: 减少C2f重复次数从3到2 ===
  - [-1, 2, C2f, [1024, True]]             # 8 (原来是3次，现在2次)
  
  - [-1, 1, SPPF, [1024, 5]]               # 9

# Neck (保持不变)
neck:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

head:
  - [[20, 24, 28], 1, Detect, [nc]]
