# YOLOv8m Custom - Shallower Backbone (V3)
# Reduces convolutional layers by decreasing C2f repeats in layer4 (backbone).
# Modification: Reduced layer4 C2f from 6 to 3 repeats (removed 3 bottlenecks = 6 conv layers).

nc: 5
depth_multiple: 1.0  # Manual control, not using global scaling
width_multiple: 1.0

backbone:
  # === Standard Backbone with Reduced Layer4 ===
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 6, C2f, [256, True]]              # 4
  
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 3, C2f, [512, True]]              # 6: REDUCED from 6 to 3 repeats (removed 3 bottlenecks)
  
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 3, C2f, [1024, True]]             # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9

neck:
  # === Indices remain unchanged! ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 3, C2f, [512]]                          # 12
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14
  - [-1, 3, C2f, [256]]                          # 15 (P3 Output)
  
  - [-1, 1, Conv, [256, 3, 2]]                   # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17
  - [-1, 3, C2f, [512]]                          # 18 (P4 Output)
  
  - [-1, 1, Conv, [512, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20
  - [-1, 3, C2f, [1024]]                         # 21 (P5 Output)

head:
  - [[15, 18, 21], 1, Detect, [nc]]              # Detect(P3, P4, P5)
