# YOLOv8m Custom - Enhanced Neck (V2)
# Adds extra C2f modules in the Neck to increase convolutional layers and feature fusion capability.

nc: 5
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # Standard Backbone (Unchanged indices 0-9)
  - [-1, 1, Conv, [64, 3, 2]]              # 0
  - [-1, 1, Conv, [128, 3, 2]]             # 1
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3
  - [-1, 6, C2f, [256, True]]              # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5
  - [-1, 6, C2f, [512, True]]              # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7
  - [-1, 3, C2f, [1024, True]]             # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9

neck:
  # === Path 1: P5 -> P4 ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 3, C2f, [512]]                          # 12
  - [-1, 2, C2f, [512, True]]                    # 13 (Extra C2f added)
  
  # === Path 2: P4 -> P3 ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 3, C2f, [256]]                          # 16
  - [-1, 2, C2f, [256, True]]                    # 17 (Extra C2f added - P3 Output)
  
  # === Path 3: P3 -> P4 ===
  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 13], 1, Concat, [1]]                   # 19
  - [-1, 3, C2f, [512]]                          # 20
  - [-1, 2, C2f, [512, True]]                    # 21 (Extra C2f added - P4 Output)
  
  # === Path 4: P4 -> P5 ===
  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 9], 1, Concat, [1]]                    # 23
  - [-1, 3, C2f, [1024]]                         # 24
  - [-1, 2, C2f, [1024, True]]                   # 25 (Extra C2f added - P5 Output)

head:
  - [[17, 21, 25], 1, Detect, [nc]]              # Detect(P3, P4, P5)
