# YOLOv8m Custom - Shallow Backbone (V3)
# Reduces the number of convolutional layers by decreasing C2f repeats.
# Note: Reducing 'repeats' does not change layer indices, ensuring Neck compatibility.

nc: 5
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # P1/2
  - [-1, 1, Conv, [64, 3, 2]]              # 0
  # P2/4
  - [-1, 1, Conv, [128, 3, 2]]             # 1
  - [-1, 3, C2f, [128, True]]              # 2
  # P3/8
  - [-1, 1, Conv, [256, 3, 2]]             # 3
  - [-1, 6, C2f, [256, True]]              # 4
  # P4/16 (Reduced from 6 to 3 repeats)
  - [-1, 1, Conv, [512, 3, 2]]             # 5
  - [-1, 3, C2f, [512, True]]              # 6
  
  # P5/32 (Reduced from 3 to 2 repeats)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7
  - [-1, 2, C2f, [1024, True]]             # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9

neck:
  # Upsample path 1 (P5 -> P4)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11 (Cat with P4 from backbone index 6)
  - [-1, 3, C2f, [512]]                          # 12
  
  # Upsample path 2 (P4 -> P3)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14 (Cat with P3 from backbone index 4)
  - [-1, 3, C2f, [256]]                          # 15 (P3 Output for Detect)
  
  # Downsample path 1 (P3 -> P4)
  - [-1, 1, Conv, [256, 3, 2]]                   # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17 (Cat with previous P4 level)
  - [-1, 3, C2f, [512]]                          # 18 (P4 Output for Detect)
  
  # Downsample path 2 (P4 -> P5)
  - [-1, 1, Conv, [512, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20 (Cat with final backbone layer SPPF)
  - [-1, 3, C2f, [1024]]                         # 21 (P5 Output for Detect)

head:
  - [[15, 18, 21], 1, Detect, [nc]]              # Detect(P3, P4, P5)
