# YOLOv8m Custom - Deeper Backbone (V2)
# Adds extra convolutional layers in the middle of the backbone (after P4).

nc: 5
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # P1/2
  - [-1, 1, Conv, [64, 3, 2]]              # 0
  # P2/4
  - [-1, 1, Conv, [128, 3, 2]]             # 1
  - [-1, 3, C2f, [128, True]]              # 2
  # P3/8
  - [-1, 1, Conv, [256, 3, 2]]             # 3
  - [-1, 6, C2f, [256, True]]              # 4
  # P4/16
  - [-1, 1, Conv, [512, 3, 2]]             # 5
  - [-1, 6, C2f, [512, True]]              # 6
  
  # === Custom Added Layers (Deeper P4 Processing) ===
  - [-1, 1, Conv, [512, 3, 1]]             # 7 (Extra Conv)
  - [-1, 2, C2f, [512, True]]              # 8 (Extra C2f with 2 bottlenecks)
  
  # P5/32
  - [-1, 1, Conv, [1024, 3, 2]]            # 9
  - [-1, 3, C2f, [1024, True]]             # 10
  - [-1, 1, SPPF, [1024, 5]]               # 11

neck:
  # Upsample path 1 (P5 -> P4)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13 (Cat with P4 from backbone index 6)
  - [-1, 3, C2f, [512]]                          # 14
  
  # Upsample path 2 (P4 -> P3)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16 (Cat with P3 from backbone index 4)
  - [-1, 3, C2f, [256]]                          # 17 (P3 Output for Detect)
  
  # Downsample path 1 (P3 -> P4)
  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 (Cat with previous P4 level)
  - [-1, 3, C2f, [512]]                          # 20 (P4 Output for Detect)
  
  # Downsample path 2 (P4 -> P5)
  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 (Cat with final backbone layer SPPF)
  - [-1, 3, C2f, [1024]]                         # 23 (P5 Output for Detect)

head:
  - [[17, 20, 23], 1, Detect, [nc]]              # Detect(P3, P4, P5)
