# YOLOv8m Custom - Shallow Backbone (V3)
# Reduces the total number of convolutional layers by decreasing model depth.

nc: 5
depth_multiple: 0.7  # Reduces C2f repeats globally (e.g., 6 -> 4, 3 -> 2)
width_multiple: 1.0

backbone:
  # Standard Backbone structure (indices remain stable)
  - [-1, 1, Conv, [64, 3, 2]]              # 0
  - [-1, 1, Conv, [128, 3, 2]]             # 1
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3
  - [-1, 6, C2f, [256, True]]              # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5
  - [-1, 6, C2f, [512, True]]              # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7
  - [-1, 3, C2f, [1024, True]]             # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9

neck:
  # Standard Neck structure (indices remain stable)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 3, C2f, [512]]                          # 12
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14
  - [-1, 3, C2f, [256]]                          # 15 (P3 Output)
  
  - [-1, 1, Conv, [256, 3, 2]]                   # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17
  - [-1, 3, C2f, [512]]                          # 18 (P4 Output)
  
  - [-1, 1, Conv, [512, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20
  - [-1, 3, C2f, [1024]]                         # 21 (P5 Output)

head:
  - [[15, 18, 21], 1, Detect, [nc]]              # Detect(P3, P4, P5)
